app/controllers/games_controller.rb

SELECT COUNT(*) FROM "games"
---
  def index
  	@games = Game.page(params[:page].to_i)